Input: Illegal migrants arrive by boat at a naval base after they were rescued by Libyan coastguard in the coastal city of Tripoli, Libya, May 10, 2017. Description: a large group of people standing on top of a boat
Input: International Protests Against Israeli Military Offensive on Gaz. Description: a protester is carried by police during a demonstration in Srinagar
Input: International Protests Against Israeli Military Offensive on Gaz. Description: a woman in a headscarf holds up a sign while other people hold up signs
Input: A paramilitary police officer carries the lifeless body of a migrant child after a number of migrants died and a smaller number were reported missing after boats carrying them to the Greek island of Kos capsized, near Bodrum, Sept. 2, 2015. Description: a man holding a small child on the beach
Input: Charge questioned-George Kanyeihamba, a former Uganda Supreme Court justice, said given the information, he knows of no treasonable offense that Besigye has committed. Description: a man is escorted by police officers on a dirt road
Input: Makerere University students burn campaign posters of incumbent President Yoweri Museveni after police detention of opposition candidate Kizza Besigye, Kampala, Feb. 15, 2016. Description: a group of people standing around a fire in the middle of a road
Input: In this still image taken from video released by a Syrian activist Wednesday smoke rises in the distance alongside the sound of heavy bombardment in east Aleppo, as a cease-fire deal to evacuate the city’s residents begins to collapse. Description: two men walk through the rubble of a city street
Input: A defense team looked at a facility in Leavenworth, Kansas earlier this month. Description: a group of men in orange prison uniforms holding chains
Input: Protesters listen to a speaker as they gather for the Women's March against President Donald Trump, Jan. 21, 2017, in Los Angeles. Description: a woman in a green coat is holding a microphone
Input: Following the order, Russian media reported that trucks carrying Turkish goods were stranded at the border. Description: a group of people sitting at a long table in front of a russian flag